backend/app/controllers/products_controller.rb

  def index
    products = Product.all
---
SELECT  "products".* FROM "products" WHERE (1) LIMIT $1  [["LIMIT", 1]]

  def show
    product = Product.find_by(id: params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    product = Product.create(product_params)
---
INSERT INTO "products" ("url", "name", "description", "likes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["url", "o"], ["name", "k"], ["description", "l"], ["likes", 0], ["created_at", "2019-04-16 08:09:48.264664"], ["updated_at", "2019-04-16 08:09:48.264664"]]

  def update
    product = Product.find_by(id: params[:id])
    product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["name", "Uni Egg"], ["updated_at", "2019-04-17 19:26:32.723300"], ["id", 1]]

  def destroy
    product = Product.find_by(id: params[:id])
    product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 73], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 43]]