backend/app/controllers/reviews_controller.rb

  def show
    review = Review.find_by(id: params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    review = Review.create(review_params)
    if review.save
---
INSERT INTO "reviews" ("content", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "ok"], ["product_id", 1], ["created_at", "2019-04-16 17:14:18.016936"], ["updated_at", "2019-04-16 17:14:18.016936"]]
INSERT INTO "reviews" ("content", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "ok"], ["product_id", 1], ["created_at", "2019-04-16 17:09:34.062267"], ["updated_at", "2019-04-16 17:09:34.062267"]]

  def destroy
    review = Review.find_by(id: params[:id]).destroy
---
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 100]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 74], ["LIMIT", 1]]