backend/app/controllers/reviews_controller.rb

  def create
    review = Review.new(content: params[:content], product_id: params[:product_id], username: params[:username])
    if review.save
---
INSERT INTO "reviews" ("content", "product_id", "created_at", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "I m in love with this product"], ["product_id", 3], ["created_at", "2019-04-15 15:42:10.474935"], ["updated_at", "2019-04-15 15:42:10.474935"], ["username", "Me"]]